app/controllers/products_controller.rb

  def create
    @product = Product.create(product_params)
---
INSERT INTO "products" ("created_at", "description", "image", "name", "preco", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-23 18:22:57.066479"], ["description", "dasddsasd"], ["image", "fasdfasdfa"], ["name", "fasdfs"], ["preco", 0.0], ["updated_at", "2015-03-23 18:22:57.066479"]]

  def update

    if @product = Product.update(params[:id],product_params)
---
UPDATE "products" SET "description" = ?, "image" = ?, "name" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["description", "fdsadfasdf"], ["image", "dfadsfas"], ["name", "fasdfasdfasd"], ["updated_at", "2015-03-23 20:00:01.755676"]]