app/controllers/static_pages_controller.rb

SELECT "products".* FROM "products"
---
  def home
  	@products = Product.all

SELECT "products".* FROM "products"
---
  def basket
  	@product = Product.all